In [2]:
# Import libraries
import pandas as pd
import numpy as np

### Load Excel File

In [3]:
filename = 'data/car_financing.xlsx'
df = pd.read_excel(filename)

## Renaming and Deleting Columns
It is often the case where you change your column names or remove unnecessary columns.

### Rename columns

Here are two popular ways to rename dataframe columns.
1. <b>dictionary substitution</b>: very useful if you only want to rename a few of the columns.
2. <b>list replacement</b>: requires a <i>full list of names</i> (in my experience, this is more error prone).

In [4]:
# DataFrame before renaming columns
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [5]:
# This wont work as there is a space in the column name
# I want to fix that
df.Principal Paid

SyntaxError: invalid syntax (1127102103.py, line 3)

In [6]:
# Fixed

0      484.30
1      487.13
2      489.98
3      492.85
4      495.73
        ...
403    786.47
404    788.37
405    790.27
406    792.18
407    794.10
Name: Principal Paid, Length: 408, dtype: float64

### Task: Rename 'Principal Paid' as 'principal_paid', and so on.

#### Approach 1: Dictionary substitution using <i>rename</i> method

In [8]:
# DataFrame after renaming columns
df.head()

,Month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

#### Approach 2: List Replacement (Not Recommended)

In [9]:
# Although we only change Month -> month, but we need to list the rest of the columns

In [10]:
df.head()

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

### Deleting Columns
#### Approach 1: Use the <i>drop</i> method to remove multiple columns at a time

Task: Remove the `term` column

In [12]:
df.head()

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,0.0702,Toyota Sienna

Remove both the columns `month` & `car_type` at a time

In [14]:
df.head()

,starting_balance,Repayment,interest_paid,principal_paid,new_balance,interest_rate
0,34689.96,687.23,202.93,484.30,34205.66,0.0702
1,34205.66,687.23,200.10,487.13,33718.53,0.0702
2,33718.53,687.23,197.25,489.98,33228.55,0.0702
3,33228.55,687.23,194.38,492.85,32735.70,0.0702
4,32735.70,687.23,191.50,495.73,32239.97,0.0702

#### Approach 2: Use the <i>del</i> command to remove multiple columns at a time

Task: Remove the `Repayment` column

In [16]:
df.head()

   starting_balance  interest_paid  principal_paid  new_balance  interest_rate
0          34689.96         202.93          484.30     34205.66         0.0702
1          34205.66         200.10          487.13     33718.53         0.0702
2          33718.53         197.25          489.98     33228.55         0.0702
3          33228.55         194.38          492.85     32735.70         0.0702
4          32735.70         191.50          495.73     32239.97         0.0702

Task: Delete the `starting_balance` and `interest_paid` columns at a time

In [18]:
df.head()

   principal_paid  new_balance  interest_rate
0          484.30     34205.66         0.0702
1          487.13     33718.53         0.0702
2          489.98     33228.55         0.0702
3          492.85     32735.70         0.0702
4          495.73     32239.97         0.0702